DELETE FROM course_grade;
DELETE FROM course_freq;
DELETE FROM course;
DELETE FROM student;
DELETE FROM teacher;



INSERT INTO student (sn, no, name, gender, academy, grade, class)  VALUES
    (101, 'S001',  '席瓦尔', 'M', '经济与管理学院', 1, '信息2002'),
    (102, 'S002',  '今原香衣璃', 'F', '马克思主义学院', 1, '哲学2001'),
    (103, 'S003',  '朴泰俊', 'M', '电子科技学院', 1, '计算机2002'),
    (104, 'S004',  '班加罗尔', 'F', '体育学院', 1, '体育2003'),
    (105, 'S005',  '艾什', 'F', '电气信息学院', 1, '通信2003'),
    (106, 'S006',  '萨默斯', 'F', '航空航天学院', 1, '航天2004');



INSERT INTO course (sn, no, name, term, credit, period)  VALUES 
    (101, 'C01',  '高数', '大一', 5, '40'), 
    (102, 'C02',  '外语', '大一', 5, '40'),
    (103, 'C03',  '计算机网络', '大二', 5, '40'),
    (104, 'C04',  '马克思主义原理', '大一', 5, '40'),
    (105, 'C05',  '装甲车辆工程', '大一', 5, '40'),
    (106, 'C06',  '葡萄和葡萄酒', '大一', 5, '40'),
    (107, 'C07',  '计算机组成原理', '大二', 5, '40'),
    (108, 'C08',  '单片机组成原理', '大二', 5, '40'),
    (109, 'C09',  '法语', '大一', 5, '40');



INSERT INTO teacher (sn, name)  VALUES 
    (101, '阿杰切'), 
    (102, '布莱西'),
    (103, '探路者'),
    (104, '布洛特亨德尔'),
    (105, '菲兹罗伊'),
    (106, '麻吉'),
    (107, '纽卡斯尔'),
    (108, '希尔');


INSERT INTO course_freq (cou_sn, tea_sn, loc, time)  VALUES 
    (101, 101, 'A公教', '1-17周 周一 1-2节'), 
    (101, 102, 'A公教', '1-17周 周一 1-2节'),
    (101, 103, 'B公教', '1-17周 周二 1-2节'),
    (102, 104, 'B公教', '1-17周 周二 1-2节'),
    (102, 105, 'B公教', '1-17周 周二 1-2节'),
    (102, 106, 'B公教', '1-17周 周二 1-2节'),
    (103, 107, 'B公教', '1-17周 周二 1-2节'),
    (103, 108, 'B公教', '1-17周 周二 1-2节'),
    (103, 103, 'B公教', '1-17周 周二 1-2节'),
    (104, 104, 'B公教', '1-17周 周二 1-2节'),
    (104, 105, 'B公教', '1-17周 周二 1-2节'),
    (104, 106, 'B公教', '1-17周 周二 1-2节'),
    (105, 102, 'B公教', '1-17周 周二 1-2节'),
    (105, 103, 'B公教', '1-17周 周二 1-2节'),
    (105, 104, 'B公教', '1-17周 周二 1-2节'),
    (106, 105, 'B公教', '1-17周 周二 1-2节'),
    (106, 107, 'B公教', '1-17周 周二 1-2节'),
    (106, 108, 'B公教', '1-17周 周二 1-2节');

INSERT INTO course_grade (stu_sn, cou_sn, grade)  VALUES 
    (101, 101,  91), 
    (102, 102,  89),
    (103, 103,  90),
    (104, 104,  89),
    (105, 105,  56),
    (106, 106,  67),
    (102, 107,  77),
    (105, 109,  78);